--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/daviddorn/Dropbox/Current Projects/china-syndrome/AER-PublishedVersion/Public Release Data/log/import_stats_final.log
  log type:  text
 opened on:   8 Jan 2013, 11:20:14

. 
. 
. *******************************************************************
. * Import levels
. *******************************************************************
. 
. use ../dta/import_levels.dta, clear
(WDI GDP and current account data)

. 
. foreach v in usch uslw usce ushi otch otlw otce othi {
  2.    foreach y in 1991 2000 2007 {
  3.           disp "imports `v', year `y'"
  4.       summ l_totimp_`v'_`y'
  5.    }
  6. }
imports usch, year 1991

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~sch_1991 |       397    26.27168           0   26.27168   26.27168
imports usch, year 2000

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~sch_2000 |       397    121.5563           0   121.5563   121.5563
imports usch, year 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~sch_2007 |       397    330.0224           0   330.0224   330.0224
imports uslw, year 1991

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~slw_1991 |       397    7.686292           0   7.686292   7.686292
imports uslw, year 2000

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~slw_2000 |       397    22.81182           0   22.81182   22.81182
imports uslw, year 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~slw_2007 |       397    45.43324           0   45.43324   45.43324
imports usce, year 1991

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~sce_1991 |       397    38.54689           0   38.54689   38.54689
imports usce, year 2000

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~sce_2000 |       397     151.594           0    151.594    151.594
imports usce, year 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~sce_2007 |       397    182.9547           0   182.9547   182.9547
imports ushi, year 1991

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~shi_1991 |       397    905.7805           0   905.7805   905.7805
imports ushi, year 2000

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~shi_2000 |       397    1865.511           0   1865.511   1865.511
imports ushi, year 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~shi_2007 |       397    2365.871           0   2365.871   2365.871
imports otch, year 1991

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~tch_1991 |       397    28.19076           0   28.19076   28.19076
imports otch, year 2000

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~tch_2000 |       397    94.28168           0   94.28168   94.28168
imports otch, year 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~tch_2007 |       397    262.8331           0   262.8331   262.8331
imports otlw, year 1991

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~tlw_1991 |       397    9.234803           0   9.234803   9.234803
imports otlw, year 2000

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~tlw_2000 |       397    13.73426           0   13.73426   13.73426
imports otlw, year 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~tlw_2007 |       397    31.03631           0   31.03631   31.03631
imports otce, year 1991

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~tce_1991 |       397    2.801011           0   2.801011   2.801011
imports otce, year 2000

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~tce_2000 |       397    5.250258           0   5.250258   5.250258
imports otce, year 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~tce_2007 |       397     11.6411           0    11.6411    11.6411
imports othi, year 1991

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~thi_1991 |       397    1708.812           0   1708.812   1708.812
imports othi, year 2000

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~thi_2000 |       397    1979.754           0   1979.754   1979.754
imports othi, year 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_t~thi_2007 |       397    3339.256           0   3339.256   3339.256

. 
. 
. *******************************************************************
. * Export levels
. *******************************************************************
. 
. use ../dta/export_levels.dta, clear
(SIC trade data for ADH post collapse of problem SIC industries)

. 
. 
. foreach v in usch otch {
  2.    foreach y in 1992 2000 2007 {
  3.           disp "exports `v', year `y'"
  4.       summ l_totexp_`v'_`y'
  5.    }
  6. }
exports usch, year 1992

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_totexp_u~2 |       397    10.32224           0   10.32224   10.32224
exports usch, year 2000

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_totexp_u~0 |       397    23.00427           0   23.00427   23.00427
exports usch, year 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_totexp_u~7 |       397    57.41103           0   57.41103   57.41103
exports otch, year 1992

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_totexp_o~2 |       397    26.63425           0   26.63425   26.63425
exports otch, year 2000

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_totexp_o~0 |       397    68.22276           0   68.22276   68.22276
exports otch, year 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
l_totexp_o~7 |       397    196.8862           0   196.8862   196.8862

. 
. log close
      name:  <unnamed>
       log:  /Users/daviddorn/Dropbox/Current Projects/china-syndrome/AER-PublishedVersion/Public Release Data/log/import_stats_final.log
  log type:  text
 closed on:   8 Jan 2013, 11:20:14
--------------------------------------------------------------------------------------------------------------------------------------------------------
